# tap "azure/functions"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/core"
tap "homebrew/services"

# brew "bats"
brew "bcrypt"
brew "python@3.9"
brew "glib"

# brew "cairo"
# brew "librsvg"  # SVG render (Cairo)

# brew "certbot"
# brew "consul"
# brew "openldap"

# brew "dotnet"
# brew "erlang"
# brew "elixir"
# brew "open-mpi"
# brew "gdk-pixbuf"

# brew "nghttp2"
# brew "gitversion"
# brew "guile"
# brew "unbound"

# brew "gobject-introspection"
# brew "tcl-tk"
# brew "harfbuzz"

# brew "pango"  # i18n rendering
# brew "graphviz"

# brew "libheif"  # HEIF encoder decoder (image file format)
# brew "imagemagick"

brew "libxml2"
brew "node"
brew "qt"
brew "poppler"
brew "vips"
brew "jsonnet"

brew "libproxy"
brew "libxmlsec1"

brew "oath-toolkit"
brew "openjdk"
brew "pkcs11-helper"

brew "pulseaudio"

brew "shellcheck"
brew "unrar"
brew "vault"
brew "watch"


## CLI tools
# brew "coreutils"
brew "bash"
brew "bash-completion"
brew "yq"  # yaml processor
brew "jq"
brew "jid"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "the_silver_searcher"
brew "tmux"
brew "gawk"
# brew "z"  # Tracks most-used directories to make cd smarter
# tap "cantino/mcfly", "https://github.com/cantino/mcfly"
# brew "cantino/mcfly/mcfly"  # shell history
brew "tree"


## APPS and UI tools
cask "caffeine"

## desktop tools / note taking / editors / presentations
cask "freemind" 
brew "joplin"
cask "joplin"

## iot/electronics/microcontrollers
# cask "fritzing"
# cask "balenaetcher"
# brew "esptool"


# password managers
brew "gnutls"
brew "gnupg"
cask "gopass-ui"
cask "keybase"
cask "lastpass"
brew "pass"
brew "pinentry-mac"
brew "gopass"
brew "lastpass-cli"
brew "pwgen"

# ntfs remount
brew "ntfs-3g"
cask "mounty"

# my touchbar / my rules
cask "mtmr"

# browsing / http tools ( curl e.t.c.) / web server tools
brew "ca-certificates"
cask "google-chrome"
cask "firefox"
brew "wget"
brew "curl"
brew "httpie"
# brew "goaccess"

# live streaming /screen recording / audio / video players 
# cask "obs"  # video recording
cask "plantronics-hub"
# cask "vlc"
# brew "youtube-dl"
# brew "asciinema"

# dev tools / languages
cask "iterm2"
# cask "chromedriver"

## editors
# cask "visual-studio-code"
cask "vscodium"
# cask "sublime-text"

## tools
cask "postman"
cask "vagrant"
cask "vagrant-manager"
brew "skaffold"
# brew "ansible"
brew "ssh-copy-id"

## terraform
brew "terraform"
brew "terraform-docs"
brew "terraform-inventory"
brew "terraform-provisioner-ansible"
brew "tflint"
brew "tfsec"

## python
cask "pycharm-ce"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pyenv-virtualenvwrapper"
brew "python@3.7"
cask "anaconda"
brew "python@3.8"
brew "ipython", link: false
# brew "checkov"

# go
brew "go"

## OCR 
brew "tesseract"
brew "tesseract-lang"
# brew "zbar"  # bar code reading

## kubernetes
brew "kube-ps1"
brew "kubectx"
cask "minikube"
brew "minikube", link: false
brew "kind"
brew "kustomize"
brew "helm"

## git
brew "git"
brew "bash-git-prompt"
brew "tig"
tap "dandavison/delta", "https://github.com/dandavison/delta"
brew "git-delta"
brew "pre-commit"


## cloud tools
brew "oci-cli"
brew "azure-cli"
# brew "azure/functions/azure-functions-core-tools@3"
# cask "microsoft-azure-storage-explorer"


## virtualisation / containerisation
cask "virtualbox"
cask "virtualbox-extension-pack"
brew "docker", link: false
brew "docker-compose", link: false

# chat / messaging / video conferencing
cask "skype"
cask "slack"
cask "viber"
cask "zoom"
cask "microsoft-teams"

# networking / vpn / monitoring
## vpns
cask "tunnelblick"
# brew "openconnect"
brew "openvpn"

##
cask "wireshark-chmodbpf"
brew "wireshark"
brew "prometheus", restart_service: true
brew "node_exporter", restart_service: true
brew "glances"  # alternative to top/htop


## security
cask "little-snitch"
cask "burp-suite"

##
brew "socat"
cask "ngrok"
brew "mtr"
brew "nmap"

# X / remote desktop tools
cask "xquartz"
brew "tiger-vnc"

# storage services
cask "dropbox"

# backup
brew "restic"

# Drivers (devices)
cask "displaylink"
